; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-73)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b17)
    (on b17 b7)
    (on b7 b3)
    (on b3 b10)
    (on b10 b19)
    (on b19 b1)
    (on b1 b22)
    (on b22 b8)
    (on b8 b11)
    (on b11 b16)
    (on b16 b20)
    (on b20 b2)
    (on b2 b18)
    (on b18 b9)
    (on b9 b14)
    (on b14 b12)
    (on-table b12)
    (clear b13)
    (on b13 b6)
    (on b6 b21)
    (on b21 b15)
    (on b15 b5)
    (on-table b5))
 (:goal (and 
(on-table b6)
(on-table b3)
(on-table b1)
(on-table b11)
(on b2 b11)
(on b7 b6)
(on b8 b1)
))
)

; plan
1. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 0 of 7
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 7
3. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 0 of 7
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 7
5. (unstack b4 b17)
   deleted: (on b4 b17) (clear b4) (arm-empty)
   added: (holding b4) (clear b17)
   goals met: 1 of 7
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 7
7. (unstack b17 b7)
   deleted: (on b17 b7) (clear b17) (arm-empty)
   added: (holding b17) (clear b7)
   goals met: 1 of 7
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 7
9. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 1 of 7
10. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 2 of 7
11. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 2 of 7
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 7
13. (unstack b10 b19)
   deleted: (on b10 b19) (clear b10) (arm-empty)
   added: (holding b10) (clear b19)
   goals met: 3 of 7
14. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 7
15. (unstack b19 b1)
   deleted: (on b19 b1) (clear b19) (arm-empty)
   added: (holding b19) (clear b1)
   goals met: 3 of 7
16. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 7
17. (unstack b1 b22)
   deleted: (on b1 b22) (clear b1) (arm-empty)
   added: (holding b1) (clear b22)
   goals met: 3 of 7
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 7
19. (unstack b22 b8)
   deleted: (on b22 b8) (clear b22) (arm-empty)
   added: (holding b22) (clear b8)
   goals met: 4 of 7
20. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 7
21. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 4 of 7
22. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 5 of 7
23. (unstack b11 b16)
   deleted: (on b11 b16) (clear b11) (arm-empty)
   added: (holding b11) (clear b16)
   goals met: 5 of 7
24. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 6 of 7
25. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 6 of 7
26. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 6 of 7
27. (unstack b20 b2)
   deleted: (on b20 b2) (clear b20) (arm-empty)
   added: (holding b20) (clear b2)
   goals met: 6 of 7
28. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 6 of 7
29. (unstack b2 b18)
   deleted: (on b2 b18) (clear b2) (arm-empty)
   added: (holding b2) (clear b18)
   goals met: 6 of 7
30. (stack b2 b11)
   deleted: (clear b11) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b11)
   goals met: 7 of 7
